ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_rtc.c
/**
 *******************************************************************************
 * @file    tmpm46b_rtc.c
 * @brief   This file provides API functions for RTC driver.
 * @version V2.0.2.1
 * @date    2015/02/11
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA ELECTRONIC DEVICES & STORAGE CORPORATION 2017 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm46b_rtc.h"

#if defined(__TMPM46B_RTC_H)

/** @addtogroup TX04_Periph_Driver
  * @{
  */

/** @defgroup RTC 
  * @brief RTC driver modules
  * @{
  */

/** @defgroup RTC_Private_Defines
  * @{
  */

#define PAGER_PAGE_SET         ((uint8_t)0x01)
#define PAGER_PAGE_CLEAR       ((uint8_t)0xFE)
#define PAGER_ADJUST_SET       ((uint8_t)0x10)
#define PAGER_ADJUST_CLEAR     ((uint8_t)0xEF)
#define PAGER_ENATMR_SET       ((uint8_t)0x08)
#define PAGER_ENATMR_CLEAR     ((uint8_t)0xF7)
#define PAGER_ENAALM_SET       ((uint8_t)0x04)
#define PAGER_ENAALM_CLEAR     ((uint8_t)0xFB)
#define PAGER_INTENA_SET       ((uint8_t)0x80)
#define PAGER_INTENA_CLEAR     ((uint8_t)0x7F)

#define RESTR_DIS_CLEAR        ((uint8_t)0x38)
#define RESTR_DIS_SET          ((uint8_t)0xC7)
#define RESTR_DIS1HZ_SET       ((uint8_t)0x80)
#define RESTR_DIS16HZ_SET      ((uint8_t)0x40)
#define RESTR_DIS2HZ_SET       ((uint8_t)0x04)
#define RESTR_DIS4HZ_SET       ((uint8_t)0x02)
#define RESTR_DIS8HZ_SET       ((uint8_t)0x01)
#define RESTR_RSTTMR_SET       ((uint8_t)0x20)
#define RESTR_RSTTMR_CLEAR     ((uint8_t)0xDF)
#define RESTR_RSTALM_SET       ((uint8_t)0x10)
#define RESTR_RSTALM_CLEAR     ((uint8_t)0xEF)

#define HOURR_HO5_SET          ((uint8_t)0x20)
#define HOURR_HO5_CLEAR        ((uint8_t)0xDF)

#define MONTHR_MO0_MASK        ((uint8_t)0x01)

#define RTC_PROTECT_SET        ((uint8_t)0xC1)
#define RTC_PROTECT_CLEAR      ((uint8_t)0x3E)

#define ADJCTL_AJEN_CLEAR      ((uint8_t)0xFE)
#define ADJCTL_AJEN_SET        ((uint8_t)0x01)

#define ADJCTL_AJSEL_CLEAR     ((uint8_t)0xF1)

#define ADJDAT_CLEAR           ((uint16_t)0x01FF)
#define ADJDAT_MODE_SET        ((uint16_t)0x0100)

/** @} */
/* End of group RTC_Private_Defines */


/** @defgroup RTC_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group RTC_Private_FunctionPrototypes */

/** @defgroup RTC_Private_Functions
  * @{
  */

/** @} */
/* End of group RTC_Private_Functions */

/** @defgroup RTC_Exported_Functions
  * @{
  */

/**
  * @brief  Set second value.
  * @param  Sec: New second value, max 59
  *   This parameter can be one of the following values:
  *   0, 1, 2, ...59 
  * @retval None
  */
void RTC_SetSec(uint8_t Sec)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_SECOND(Sec));

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Sec / 10U) * 16U + Sec % 10U);
    /* Write sec value into SECR register */
    TSB_RTC->SECR = tmp;
}

/**
  * @brief  Get second value.
  * @param  None
  * @retval The second value.
  */
uint8_t RTC_GetSec(void)
{
    uint8_t sec = 0U;
    uint8_t tmp = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;

    do {
        tmp = TSB_RTC->SECR;
        sec = TSB_RTC->SECR;
    }
    while (tmp != sec);

    sec = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return second value  */
    return sec;
}

/**
  * @brief  Set minute value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @param  Min: New minute value, max 59
  *   This parameter can be one of the following values:
  *   0, 1, 2, ...59 
  * @retval None
  */
void RTC_SetMin(RTC_FuncMode NewMode, uint8_t Min)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_MINUTE(Min));
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_ALARM_MODE) {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
    } else {
        /* Select PAGE0 */
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Min / 10U) * 16U + Min % 10U);
    /* Write min value into MINR register */
    TSB_RTC->MINR = tmp;
}

/**
  * @brief  Get minute value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @retval The minute value.
  */
uint8_t RTC_GetMin(RTC_FuncMode NewMode)
{
    uint8_t min = 0U;
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        do {
            tmp = TSB_RTC->MINR;
            min = TSB_RTC->MINR;
        }
        while (tmp != min);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        tmp = TSB_RTC->MINR;
    }

    min = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return minute value  */
    return min;
}

/**
  * @brief  Get AM or PM state in the 12 Hour mode.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE
  * @retval mode: The mode of the time.
  *   This parameter can be one of the following values:
  *   RTC_AM_MODE, RTC_PM_MODE 
  */
uint8_t RTC_GetAMPM(RTC_FuncMode NewMode)
{
    uint8_t tmp = 0U;
    uint8_t mode = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        do {
            tmp = TSB_RTC->HOURR;
            mode = TSB_RTC->HOURR;
        }
        while (tmp != mode);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        tmp = TSB_RTC->HOURR;
    }

