ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_rtc.c
    /* Get minute value */
    AlarmStruct->Min = RTC_GetMin(RTC_ALARM_MODE);
}

/**
  * @brief  Enable or disable Clock correction function register protection
  * @param  NewState: New state of the RTC protect register
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void RTC_SetProtectCtrl(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Set RTCPROTECT */
    if (NewState == ENABLE) {
        TSB_RTC->PROTECT = RTC_PROTECT_SET;
    } else {
        TSB_RTC->PROTECT = RTC_PROTECT_CLEAR;
    }
}

/**
  * @brief  Enable RTC correction function.
  * @param  None
  * @retval None
  */
void RTC_EnableCorrection(void)
{
    uint8_t tmp = 0U;

    /* Set RTCADJCTL<AJEN> to enable correction function */
    tmp = TSB_RTC->ADJCTL;
    tmp |= ADJCTL_AJEN_SET;
    TSB_RTC->ADJCTL = tmp;
}

/**
  * @brief  Disable RTC correction function.
  * @param  None
  * @retval None
  */
void RTC_DisableCorrection(void)
{
    uint8_t tmp = 0U;

    /* Clear RTCADJCTL<AJEN> to disable correction function */
    tmp = TSB_RTC->ADJCTL;
    tmp &= ADJCTL_AJEN_CLEAR;
    TSB_RTC->ADJCTL = tmp;
}

/**
  * @brief  Set correction reference time.
  * @param  Time: Correction reference time
  *   This parameter can be one of following values:
  *   RTC_ADJ_TIME_1_SEC, RTC_ADJ_TIME_10_SEC, 
  *   RTC_ADJ_TIME_20_SEC, RTC_ADJ_TIME_30_SEC,
  *   RTC_ADJ_TIME_1_MIN
  * @retval None
  */
void RTC_SetCorrectionTime(uint8_t Time)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_ADJ_TIME(Time));

    /* Set RTCADJCTL<AJSEL> */
    tmp = TSB_RTC->ADJCTL;
    tmp &= ADJCTL_AJSEL_CLEAR;
    tmp |= Time;
    TSB_RTC->ADJCTL = tmp;
}

/**
  * @brief  Set correction value.
  * @param  Mode: The mode of correction 
  *   This parameter can be one of following values:
  *   RTC_CORRECTION_PLUS, RTC_CORRECTION_MINUS
  * @param  Cnt:The value of correction
  *   This parameter can be 0~255 when Mode is RTC_CORRECTION_PLUS.
  *   This parameter can be 1~256 when Mode is RTC_CORRECTION_MINUS.
  * @retval None
  */
void RTC_SetCorrectionValue(RTC_CorrectionMode Mode, uint16_t Cnt)
{
    uint16_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_CORRECTION_MODE(Mode));
    if (Mode == RTC_CORRECTION_PLUS) {
        /* Check the parameters */
        assert_param(IS_RTC_PLUS_VALUE(Cnt));

        /* Set RTCADJDAT<ADJDAT> */
        TSB_RTC->ADJDAT = Cnt;
    } else {
        /* Check the parameters */
        assert_param(IS_RTC_MINUS_VALUE(Cnt));

        /* Set RTCADJDAT<ADJDAT> */
        tmp = ADJDAT_MODE_SET;
        tmp |= (~(Cnt - 1U));
        tmp &= ADJDAT_CLEAR;
        TSB_RTC->ADJDAT = tmp;
    }
}

/** @} */
/* End of group RTC_Exported_Functions */

/** @} */
/* End of group RTC */

/** @} */
/* End of group TX04_Periph_Driver */
#endif                          /* defined(__TMPM46B_RTC_H) */
